# 支行长数字工作台——页面展示

## 页面基础展示效果-经营概况
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"1"个tab

更新标准截图"支行长数字工作台"_"经营概况1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"经营概况1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"4"秒
更新标准截图"支行长数字工作台"_"经营概况2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"经营概况2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"4"秒
更新标准截图"支行长数字工作台"_"经营概况3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"经营概况3",容错率"0.003"


## 页面基础展示效果-重点关注
[重点关注](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 等待"2"秒

更新标准截图"支行长数字工作台"_"重点关注1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"重点关注1",容错率"0.1"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"重点关注2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"重点关注2",容错率"0.1"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"重点关注3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"重点关注3",容错率"0.1"


## 页面基础展示效果-绩效管理
[绩效管理](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"3"个tab
* 等待"2"秒

更新标准截图"支行长数字工作台"_"绩效管理1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"绩效管理1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"绩效管理2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"绩效管理2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"绩效管理3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"绩效管理3",容错率"0.003"


## 页面基础展示效果-机构存款
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 点击模板内"CATALOGGROUP0"目录的第"1"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"机构存款1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"机构存款2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"机构存款3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款3",容错率"0.003"

* 刷新页面
* 等待"2"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 等待"2"秒

更新标准截图"支行长数字工作台"_"机构存款4"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款4",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"机构存款5"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款5",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"机构存款6"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"机构存款6",容错率"0.003"


## 页面基础展示效果-贷款分析
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 点击模板内"CATALOGGROUP0"目录的第"2"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"贷款分析1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款分析1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"贷款分析2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款分析2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"贷款分析3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款分析3",容错率"0.003"


## 页面基础展示效果-风险监控
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 点击模板内"CATALOGGROUP0"目录的第"3"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"风险监控1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"风险监控1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"风险监控2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"风险监控2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"风险监控3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"风险监控3",容错率"0.003"

## 页面基础展示效果-贷款发生明细
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 点击模板内"CATALOGGROUP1"目录的第"1"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"贷款发生明细1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款发生明细1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"贷款发生明细2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款发生明细2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"贷款发生明细3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"贷款发生明细3",容错率"0.003"

## 页面基础展示效果-到期合同
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 点击模板内"CATALOGGROUP1"目录的第"2"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"到期合同1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"到期合同1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"到期合同2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"到期合同2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"到期合同3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"到期合同3",容错率"0.003"

## 页面基础展示效果-未用信清单
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 点击模板内"CATALOGGROUP1"目录的第"3"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"未用信清单1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"未用信清单1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"未用信清单2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"未用信清单2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"未用信清单3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"未用信清单3",容错率"0.003"

## 页面基础展示效果-大额动账
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 点击模板内"CATALOGGROUP1"目录的第"5"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"大额动账1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"大额动账1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"大额动账2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"大额动账2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"大额动账3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"大额动账3",容错率"0.003"

## 页面基础展示效果-收单商户
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"2"个tab
* 点击模板内"CATALOGGROUP1"目录的第"6"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"收单商户1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"收单商户1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"收单商户2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"收单商户2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"收单商户3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"收单商户3",容错率"0.003"

## 页面基础展示效果-客户经理存款
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"3"个tab
* 点击模板内"CATALOGGROUP2"目录的第"1"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"客户经理存款1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理存款1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"客户经理存款2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理存款2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"客户经理存款3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理存款3",容错率"0.003"

## 页面基础展示效果-客户经理贷款
[经营概况](https://work.fineres.com/browse/MTT-XXXXX)
* H5访问地址"http://www.fanruanbank.com/webroot/decision/url/mobile#/form?title=%E6%94%AF%E8%A1%8C%E9%95%BF%E6%95%B0%E5%AD%97%E5%B7%A5%E4%BD%9C%E5%8F%B0&showType=5&id=a9d83113-9d4f-4497-9fff-70161c1f92f4"
* H5登录,用户名"Lianbin.tu",密码"tlb@123fr"
* 等待"5"秒
* 切换tab组件"TABPANE0"到第"3"个tab
* 点击模板内"CATALOGGROUP2"目录的第"2"个目录
* 等待"2"秒

更新标准截图"支行长数字工作台"_"客户经理贷款1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理贷款1",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"844"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"客户经理贷款2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理贷款2",容错率"0.003"

* 模板滑动到水平位置"0",垂直位置"1688"
* 等待"2"秒
更新标准截图"支行长数字工作台"_"客户经理贷款3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"支行长数字工作台"_"客户经理贷款3",容错率"0.003"




