# 标签


## 分析表-1
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 新建分析表并使用表名为"合同事实表"的数据表并"确定"
* 选取"所有"字段
* 点击"标题栏左侧"添加历史步骤"上下合并"
更新标准截图"九数云"_"测试1"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试1",容错率"0.003"

## 分析表-2
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 新建分析表并使用表名为"合同事实表"的数据表并"确定"
* 选取"所有"字段
* 点击分析表标题栏"自动监控"
* 点击分析表标题栏"添加图表"
* 拖拽"图表字段""合同ID"到"数据"中
更新标准截图"九数云"_"测试2"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试2",容错率"0.003"

## 分析表-3
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 新建分析表并使用表名为"合同事实表"的数据表并"确定"
* 选取"所有"字段
* 点击"右侧栏"添加历史步骤"分类汇总"
* 拖拽"字段""购买数量"到"汇总"中
* "点击按钮"合并上一步数据，选取"合同ID"字段并"确定"
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"

## 分析表-4
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 新建分析表并使用表名为"合同事实表"的数据表并"确定"
* 选取"所有"字段
* 点击"右侧栏"添加历史步骤"字段重命名"
* "添加"重命名,将第"1"个字段"合同ID"重命名为"1"
更新标准截图"九数云"_"测试23"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试23",容错率"0.003"

## 分析表-5
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"左右合并"
"左右合并"-选中表"子",选择字段"所有"并"确定"
"左右合并"-"不切换表选择字段"并"确定"(合并表来源表"子"的字段"所有")
* 设置合并方式"并集合并"
更新标准截图"九数云"_"测试5"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试5",容错率"0.003"

## 分析表-6
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 选中并点击"父1"
* 分析表"父1"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"列转行"
* 列转行-待转换字段为"date"并"确定按钮"
更新标准截图"九数云"_"测试6"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试6",容错率"0.003"

## 分析表-7
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 选中并点击"父1"
* 分析表"父1"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"行转列"
* 行转列-"name"列字段"amanda"转化为第"4"个值字段
更新标准截图"九数云"_"测试7"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试7",容错率"0.003"

## 分析表-8
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
新建分析表并使用表名为"合同事实表"的数据表并"确定"
选取"所有"字段
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"筛选"
添加筛选条件
* 设置筛选"3"为普通条件,"数值""合同金额""介于""32000 (小于) 值 (小于等于) 90000"并点击"保存"
设置筛选"3"为普通条件,"数值""合同金额""等于""560000"并点击"保存"
设置筛选"1"为普通条件,"文本""合同类型""属于""购买合同"并点击"确定按钮"
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"

## 分析表-9
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
新建分析表并使用表名为"合同事实表"的数据表并"确定"
选取"所有"字段
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"新增字段-公式/函数"
* 新增字段类型"文本"字段名"1"
* 添加公式"MIN"
* 添加公式字段"购买数量"
* 添加公式符号"+"
* 添加公式字段"合同金额"
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"
## 分析表-10
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"新增字段-分类赋值"
* 新增字段名为"456"
* 设置赋值依据为"合同类型"
* 点击添加分类
* 修改第"2"个为分类名"tingting"
* 将字段"购买合同,长期协议"移动至分类"ting"
* 等待"8"秒
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"

## 分析表-11
新建分析表并使用表名为"合同事实表"的数据表并"确定"
选取"所有"字段
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"新增字段-公式/函数"
* 新增字段类型"文本"字段名"1"
* 公式输入"${合同金额}"
* 等待"8"秒
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"
## 分析表-12
新建分析表并使用表名为"合同事实表"的数据表并"确定"
选取"所有"字段
* 选中并点击"JSY_AutoTest"
* 选中并点击"测试分析表"
* 分析表"测试分析表"的主页"点击""编辑"
* 点击"右侧栏"添加历史步骤"新增字段-累积值"
* 新增字段名为"2"
* 设置计算字段为"购买数量",设置计算方式为"最大值"
设置计算范围为全部值
* 设置计算范围"分类值"，选择分类为"合同类型,合同金额"并点击"确定按钮"
* 等待"8"秒
更新标准截图"九数云"_"测试22"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试22",容错率"0.003"
## 仪表板-XXX
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 新建"仪表板"组件
* 拖拽"图表""图表-子表"到"仪表板"中
更新标准截图"九数云"_"测试3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试3",容错率"0.003"

## 平台-1
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* ("通用")-将第"1"个"仪表板""创建副本"
* 切换项目下文件排序方式为"按名称排序"
更新标准截图"九数云"_"测试3"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试3",容错率"0.003"

## 平台-2
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)
* 选中并点击"JSY_AutoTest"
* 选中并点击"子"
* 分析表"子"的主页"点击""血缘视图"
更新标准截图"九数云"_"测试4"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试4",容错率"0.003"

## 平台-3
[一级-二级设置](https://work.fineres.com/browse/JSYTT-XXXXX)

* 选择文件范围为"创建者,其他成员"
选择文件范围为"自己"
点击切换企业"暮雨呼寒的企业"团队"jsy"
创建团队"9876"并"确定"
设置团队名称为"Gauge111"并"确定"
创建企业"12345"并"确定"
* 编辑企业名称"就等"并"确定"
* 等待"8"秒
打开新的浏览器并输入地址"https://test.jiushuyun.com/decision/shared/b51c7d05"
更新标准截图"九数云"_"测试333"(更新标准截图后要手动确认，确认无误后在测试用例注释掉)
* 截图对比"九数云"_"测试333",容错率"0.003"
